app/services/order_history_csv_parsing.rb

INSERT INTO "orders" ("order_date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["order_date", "2019-04-01 02:10:32"], ["created_at", "2019-05-30 19:00:41.234932"], ["updated_at", "2019-05-30 19:00:41.234932"]]
SELECT  "products".* FROM "products" WHERE "products"."description" = $1 AND "products"."type" = $2 AND "products"."size" = $3 LIMIT $4  [["description", "t-shirt"], ["type", "Accessory"], ["size", 0], ["LIMIT", 1]]
INSERT INTO "purchases" ("order_id", "product_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 6], ["product_id", 3], ["quantity", 1], ["created_at", "2019-05-30 19:03:04.535226"], ["updated_at", "2019-05-30 19:03:04.535226"]]
---
  def self.parse_orders
    require 'csv'
    csv = CSV.read('lib/assets/OrdersRecord.csv')
    description_row = csv[1]
    size_row = csv[0]
    (2...csv.length).each do |row_index|
      row = csv[row_index]
      order = Order.create!(order_date: (row[0] + row[1]).to_datetime)
      (2...row.length).each do |column_index|
        value = row[column_index]&.to_i
        next unless value > 0

        size = determine_size(size_row, column_index)
        type = column_index > 5 ? 'Accessory' : 'StuffedAnimal'
        product = Product.find_by(description: description_row[column_index]&.downcase, type: type, size: size)
        order.purchases.create!(product: product, quantity: value)